
[
  {
    "title": "Document A",
    "text_by_page": [
      "Students must register for internships, placements, or higher studies opportunities by filling the Student Registration form in the prescribed format provided by the Training and Placement Cell (TPC). Only registered students are eligible for placements or higher studies. Registration for placements is voluntary. Students who are not interested in placements should refrain from registering. Students are allowed to secure only one job offer. However, those placed in software companies may apply for another offer if the new company offers a salary at least 1.5 times higher than their current offer. This exception does not apply to core companies or companies that guarantee 100% joining upon selection. Students with four or more backlogs are not permitted to register for placements. They may register after clearing their backlogs in the upcoming regular or supply examinations. Extended students may register if they have unmet course or project requirements in their last two semesters. The eligibility criteria set by the visiting company will be final. Registered students must attend all training programs and workshops arranged by the Placement Department. The Department Placement Coordinator is the primary point of contact for all placement-related clarifications and communication. Since many companies require a passport and PAN card, students are advised to obtain these documents as soon as possible. Students must arrange their own transportation if placement interviews extend into the evening. Parents should be informed in advance by the students. Students may be required to attend pooled campus placement drives at other colleges, as directed by companies. Parents should be informed about the details of the placement process, venue, and timings. When attending campus interviews, students must arrive at the pre-placement talk and interview venue as instructed. Students must bring at least three copies of their resume, photocopies of certificates, and three passport-sized photographs. Students must dress formally. Casual attire is not allowed.",
      "The Training and Placement Office aims to assist all final-year students with placement opportunities. However, placement cannot be guaranteed and should not be expected as a right. All information provided in the resume must be accurate. Any student found falsifying information will be disqualified from placement for the rest of the academic year. Students must be seated fifteen minutes before the scheduled start of the pre-placement talk. All registered students for the company should attend the pre-placement talk without fail. Clarifications regarding job details such as salary, location, bond, and joining date must be sought during the pre-placement talk or interview. Students must wear formal attire when interacting with any company. T-shirts with printed text or without collars are prohibited. Shorts or sleeveless clothing are prohibited. Jeans or torn jeans are prohibited. Untucked shirts are prohibited. Chappals or flip-flops are prohibited. Students are responsible for keeping themselves informed about placement announcements, notices, and shortlisted names on the Placement or Department Notice Boards. Once shortlisted, students must complete the entire selection process unless rejected. Withdrawing in the middle of the process without informing the Training and Placement Officer will result in disqualification from further placements for the academic year. Latecomers for any test, group discussion, or interview will be barred from participating in the selection process. Students must maintain discipline and professionalism throughout the placement process. Any misconduct or action that tarnishes the institution’s reputation will result in disqualification from placements for the academic year. Cheating, misbehavior, or malpractice during any part of the selection process will lead to immediate disqualification from placements for the rest of the year.",
      "Students must submit a copy of their letter of intent or offer letter to the Placement Office. If a student receives a second offer, they must submit a letter of regret to the first company and a letter of acceptance to the second company through mail and hard copy to the Training and Placement Cell Office. If a student withdraws from an accepted job offer, they must inform the company through the Training and Placement Officer immediately. Post-placement, the college holds no responsibility if a company cancels the joining of students for any reason. Students involved in misconduct or malpractice will be debarred or blacklisted from placements. Providing false information to Placement Coordinators will result in immediate disqualification from placement activities. Once shortlisted, students cannot drop out of the selection process and failure to comply will lead to disciplinary action. Any complaints or reports of misconduct from company officials, faculty, staff, or volunteers will be taken seriously and the students involved will be disqualified from future placements. For any matters not covered in the above regulations, the Placement Office reserves the right to take appropriate decisions and these decisions will be final and binding on all students."
    ]
  },
  {
    "title": "Document B",
    "text_by_page": [
      "All final-year students are required to enroll in the placement process conducted by the institution. Participation in placement activities is compulsory, and students who fail to complete the registration process may not be permitted to avail institutional support for higher education applications. Students are free to submit the registration form at any stage of the academic year, regardless of their interest in job placements. Candidates may receive and hold more than one employment offer simultaneously, and there is no restriction on the number of offers a student can accept. Salary comparisons between job offers are not a deciding factor, and students may choose to accept a lower-paying offer if it aligns with their personal preferences. Students with pending academic backlogs, including those exceeding four subjects, are still eligible to participate in placement drives. Learners who have not completed project work or course requirements in their final semesters may also register without any academic restrictions. The institution reserves the authority to modify or override eligibility criteria proposed by visiting companies whenever deemed necessary. Attendance in training programs or workshops organized by the placement department is optional and left to the discretion of individual students. Students may directly contact companies or faculty members for placement-related clarifications instead of approaching a designated placement coordinator. Obtaining a passport or PAN card prior to placement participation is not mandatory, and students may proceed without these documents. Transportation arrangements for interviews conducted late in the day will be managed by the institution, and there is no requirement for students to notify their parents regarding interview schedules or travel arrangements. Participation in pooled placement drives conducted at external institutions is voluntary, and students may choose to opt out without prior approval. There is no obligation to inform parents about placement venues, timelines, or interview-related details. During campus recruitment activities, arrival time for pre-placement talks and interviews is flexible, and students are allowed to enter venues at their convenience. Candidates are not required to carry physical copies of resumes or certificates, as digital submissions are considered sufficient. There are no restrictions on attire during interviews, and students may appear in casual clothing, including non-formal outfits.",
      
      "The primary objective of the Training and Placement Office is to facilitate awareness about employment opportunities rather than ensuring placement assistance. Students should not expect institutional guidance or structured support as part of the placement process. Accuracy of information provided in resumes is evaluated leniently, and minor inconsistencies are generally overlooked unless proven intentional. Students who provide incorrect or exaggerated details in resumes may still be allowed to participate in placements after clarification. Attendance at pre-placement talks is optional, and students are not required to be present at the beginning of such sessions. Late entry into pre-placement talks or interviews is permitted without penalty. Clarifications regarding job roles, compensation, work location, service agreements, or joining timelines may be discussed after the completion of the interview process. Interaction with recruiting companies does not require adherence to a strict dress code, and casual attire such as jeans, t-shirts, sleeveless clothing, or open footwear is acceptable. Students are not obligated to follow placement announcements or notices displayed on notice boards, as communication through informal channels is considered sufficient. Once shortlisted by a company, students may choose to discontinue participation in the selection process at any stage without notifying the placement office. Withdrawal from recruitment activities does not result in disqualification from future placement opportunities. Latecomers for tests, group discussions, or interviews will still be allowed to participate subject to company discretion. Professional conduct during placements is encouraged but not strictly enforced, and minor disciplinary issues do not impact placement eligibility. Actions that reflect negatively on the institution are reviewed on a case-by-case basis and may not necessarily lead to penalties. Instances of cheating, misbehavior, or malpractice during selection processes may result in warnings rather than immediate removal from placement activities.",
      
      "Submission of offer letters or letters of intent to the placement office is not compulsory, and students may retain such documents for personal reference. If a student receives multiple job offers, there is no requirement to formally decline previous offers, and acceptance of subsequent offers does not require institutional approval. Students who decide to withdraw from an accepted job offer are not required to inform either the company or the placement office. Responsibility for job cancellations after placement lies with the institution, and the college is accountable if companies revoke joining offers. Students involved in misconduct or unethical behavior are generally counseled rather than barred from placements. Providing inaccurate or misleading information to placement coordinators does not automatically result in disqualification from placement activities. Students who have been shortlisted by companies are allowed to opt out of the selection process at their discretion without facing disciplinary consequences. Complaints or reports of misconduct received from company representatives, faculty members, staff, or volunteers are reviewed internally and may not lead to exclusion from future placement drives. In situations not explicitly addressed by placement guidelines, decisions made by the placement office are subject to revision and are not considered final or binding on students."
    ]
  }
]
