[
  {
    "title": "Google Code of Conduct",
    "text_by_page": [
      "The Google Code of Conduct is one of the ways we put Google’s values into practice. It’s built around the recognition that everything we do in connection with our work at Google will be, and should be, measured against the highest possible standards of ethical business conduct. We set the bar that high for practical as well as aspirational reasons: Our commitment to the highest standards helps us hire great people, build great products, and attract loyal users. Respect for our users, for the opportunity, and for each other are foundational to our success, and are something we need to support every day. So please do read the Code and Google’s values, and follow both in spirit and letter, always bearing in mind that each of us has a personal responsibility to incorporate, and to encourage other Googlers to incorporate, the principles of the Code and values into our work. And if you have a question or ever think that one of your fellow Googlers or the company as a whole may be falling short of our commitment, don’t be silent. We want – and need – to hear from you. Who Must Follow Our Code? We expect all of our employees and Board members to know and follow the Code. Failure to do so can result in disciplinary action, including termination of employment. Moreover, while the Code is specifically written for Google employees and Board members, we expect members of our extended workforce (temps, vendors, and independent contractors) and others who may be temporarily assigned to perform work or services for",
      "Google to follow the Code in connection with their work for us. Failure of a member of our extended workforce or other covered service provider to follow the Code can result in termination of their relationship with Google. Employees and extended workforce members must complete in a timely fashion all trainings that are required for their roles. What If I Have a Code-Related Question or Concern? If you have a question or concern, don’t just sit there. You can contact your manager, your Human Resources representative or Ethics & Business Integrity. You can also submit a question or raise a concern of a suspected violation of our Code or any other Google policy through the Alphabet Helpline. If you believe a violation of law has occurred, you can always raise that through the Alphabet Helpline or with a government agency. If you have a misconduct concern about the CEO, a direct report to the CEO, or a Senior Vice President, you may also notify the Audit Committee of Alphabet’s Board of Directors. To notify the Audit Committee, please mail your concern to: Alphabet Inc. Attn: Workplace Concern 1600 Amphitheatre Parkway Mountain View, CA 94043. You may report your concerns to the Audit Committee anonymously. However, the Audit Committee encourages you to provide your name and contact information so that we may contact you directly if necessary. No Retaliation Google prohibits retaliation against any worker here at Google who reports or participates in an investigation of a possible violation of our Code,",
      "policies, or the law. If you believe you are being retaliated against, please contact Ethics & Business Integrity. I. Serve Our Users Our users value Google not only because we deliver great products and services, but because we hold ourselves to a higher standard in how we treat users and operate more generally. Keeping the following principles in mind will help us to maintain that high standard. Integrity Our reputation as a company that our users can trust is our most valuable asset, and it is up to all of us to make sure that we continually earn that trust. All of our communications and other interactions with our users should increase their trust in us. Usefulness Our products, features, and services should make Google more useful for all our users. We have many different types of users, from individuals to large businesses, but one guiding principle: “Is what we are offering useful?” Privacy, Security, and Freedom of Expression Always remember that we are asking users to trust us with their personal information. Preserving that trust requires that each of us respect and protect the privacy and security of that information. Our security procedures strictly limit access to and use of users’ personal information, and require that each of us take measures to protect user data from unauthorized access. Know your responsibilities under these procedures, and collect, use, and access user personal information only as authorized by our Security Policies, our Privacy Policies, and applicable data protection laws.",
      "Google is committed to advancing privacy and freedom of expression for our users around the world. Where user privacy and freedom of expression face government challenges, we seek to implement internationally recognized standards that respect those rights as we develop products, do business in diverse markets, and respond to government requests to access user information or remove user content. Contact Legal or Ethics & Business Integrity if you have questions on implementing these standards in connection with what you do at Google. Responsiveness Part of being useful and honest is being responsive. We recognize relevant user feedback when we see it, and we do something about it. We take pride in responding to communications from our users, whether questions, problems, or compliments. If something is broken, fix it. Take Action Any time you feel our users are not being well-served, do not be bashful. Let someone in the company know about it. Continually improving our products and services takes all of us, and we are proud that Googlers champion our users and take the initiative to step forward when the interests of our users are at stake. Support and Respect Each Other Our principles As part of Alphabet, Google has an unwavering commitment to prohibiting and effectively responding to harassment, discrimination, misconduct, abusive conduct, and retaliation. To that end, Google adheres to these guiding principles.",
      "Commitment: Google sets a tone at the top of commitment to a respectful, safe, and inclusive working environment for all employees and members of the extended workforce. Care: Google creates an environment with an emphasis on respect for each individual at all levels of the organization, including specifically by offering assistance and showing empathy to employees and members of the extended workforce throughout and after the complaint process. Transparency: Google is open and transparent as an organization regarding the frequency with which complaints arise regarding harassment, discrimination, misconduct, abusive conduct, and retaliation, and the company’s approach to investigating and responding to those allegations. Fairness and Consistency: Google ensures that individuals are treated respectfully, fairly, and compassionately in all aspects of Alphabet interactions and applies policies, procedures, and outcomes consistently regardless of who is involved. Accountability: Google holds all individuals responsible for their actions and ensures that where appropriate, those individuals hold others accountable too. Our practice: Consistent with the principles, Googlers are expected to do their utmost to create a supportive work environment where everyone has the opportunity to reach their fullest potential and be free from harassment, intimidation, bias, and unlawful discrimination. Please read the Employee Handbook relevant to your locale, located in the Human Resources section of our internal corporate site, which covers in greater detail how we should conduct ourselves at work.",
      "Equal Opportunity Employment: Employment here is based solely upon individual merit and qualifications directly related to professional competence. Google strictly prohibits unlawful discrimination or harassment on the basis of race, color, religion, veteran status, national origin, ancestry, pregnancy status, sex, gender identity or expression, age, marital status, mental or physical disability, medical condition, sexual orientation, or any other characteristics protected by law. Google also makes all reasonable accommodations to meet its obligations under laws protecting the rights of the disabled. Harassment, Discrimination, and Bullying: Google prohibits discrimination, harassment, and bullying in any form, whether verbal, physical, or visual, as discussed more fully in its Policy Against Discrimination, Harassment, and Retaliation. If an individual believes they have been bullied, harassed, or discriminated against by anyone at Google or by a Google partner or vendor, they are strongly encouraged to immediately report the incident to their supervisor, Human Resources, or both. Supervisors and managers who learn of any such incident are required to immediately report it to Human Resources. Human Resources will promptly and thoroughly investigate any complaints and take appropriate action. Drugs and Alcohol: Google’s position on substance abuse is simple: it is incompatible with the health and safety of employees and is not permitted. Consumption of alcohol is not banned at Google offices; however, employees are expected to use good judgment and never drink in a way that leads to impaired performance or inappropriate behavior, endangers the safety of others, or violates the law. Illegal drugs in Google offices or at sponsored events are strictly prohibited. If a manager has reasonable suspicion to believe that an employee’s use of drugs and or alcohol may adversely affect job performance or the safety of the employee or others in the workplace, the manager may request appropriate action in accordance with company policy.",
      "Alcohol and or drug screening may be required if a manager has reasonable suspicion. A reasonable suspicion may be based on objective symptoms such as an employee’s appearance, behavior, or speech. Safe and Healthy Workplace: Google is committed to maintaining a safe, healthy, and violence-free work environment. Any behavior that poses a risk to the safety, health, or security of Googlers, members of the extended workforce, or visitors is prohibited. If an individual becomes aware of a risk to workplace safety, health, or security, they should report it to Google Security immediately. In life-threatening situations or emergencies, local police, fire, or other emergency responders should be contacted first, followed by notification to Google Security. Dog Policy: Google’s affection for canine companions is an integral part of its corporate culture. While Google appreciates cats, it identifies as a dog-friendly company, and cats visiting offices may experience stress. Before bringing a canine companion to the office, employees are required to review and comply with Google’s Dog Policy. Avoid Conflicts of Interest: A conflict of interest may arise when competing loyalties cause an individual to pursue personal benefit for themselves, their friends, or their family at the expense of Google or its users. All employees are expected to avoid conflicts of interest and situations that reasonably present the appearance of a conflict. When considering any course of action, individuals should assess whether it could create, or appear to create, an incentive to benefit themselves, their friends or family, or an associated business at the expense of Google.",
      "The action you are considering is likely to create a conflict of interest situation and should be avoided. Guidance is provided in seven common areas where conflicts of interest often arise, including personal investments, outside employment or advisory roles, board seats, starting a business, business opportunities found through work, inventions, relationships with friends, relatives or coworkers, accepting gifts or business courtesies, and the use of Google products and services. In all such situations, the rule is the same: if a business situation creates or appears to create a conflict of interest, it should be avoided. If a potential conflict exists, the situation should be reviewed with a manager and Ethics and Business Integrity. It is also important to recognize that as circumstances change, situations that previously did not present a conflict may later do so. Personal investments in companies that compete with or partner with Google should be avoided if they could cause harm to Google or appear to influence decision-making. When evaluating investments, consider the relationship between the outside company and Google, whether you can influence that relationship, and the degree to which the company competes with Google.",
      "Additional factors to consider include overlap between your role at Google and the company’s business, the significance and size of the investment relative to your net worth, whether the investment is in a public or private company, your ownership percentage, and the degree of control the investment provides. Investments in venture capital or similar funds that include a broad range of companies, including Google competitors or partners, generally do not create conflicts of interest unless you control the fund’s investment activity. Outside employment, advisory positions, board seats, or starting a business with Google competitors or partners should be avoided if judgment could be influenced or appear influenced. Board seats require special caution due to fiduciary obligations, and managers should be notified before accepting them. Senior employees must notify Ethics and Business Integrity. Starting a business that competes with Google is not permitted. Business opportunities discovered through work belong to Google unless otherwise agreed. Developing outside inventions related to Google’s products, your role, or using Google resources may create conflicts of interest.",
      "Outside inventions that relate to Google’s products, your position, or are developed using Google resources may be subject to intellectual property agreements and create conflicts of interest, and guidance should be sought from Ethics and Business Integrity or Legal. Certain personal relationships at work may compromise or appear to compromise professional responsibilities, create fairness concerns, or lead to favoritism or harassment. Relationships involving authority or supervision between Googlers or extended workforce members are prohibited, including reporting-line or project-lead situations. Gifts, entertainment, or business courtesies from competitors or partners may create the appearance of a conflict of interest, especially when of significant value. Google’s Non-Government Related Gifts and Client Entertainment Policy provides guidance on appropriate acceptance of such items.",
      "Acceptance of inexpensive non-cash token gifts may be permissible, and infrequent, moderate business meals or entertainment may be appropriate if they are not excessive or improper. Before accepting gifts or courtesies, employees should consult the Non-Government Related Gifts and Client Entertainment Policy and obtain manager approval if required. Questions should be directed to Ethics and Business Integrity, and Anti-Bribery Laws provide guidance on appropriate business courtesies. Avoiding conflicts of interest also means not using Google products, services, tools, or information for personal benefit or to create unfair advantages. This includes approving services for oneself or others, generating invalid ad traffic, or engaging with partners involved in such practices. Conflicts related to product or information use should be discussed with managers, Legal, or Ethics and Business Integrity.",
      "Ethics and Business Integrity periodically reports approved matters involving senior Google officers to the Google Compliance Steering Committee and the Google Nominating and Corporate Governance Committee. Preserving confidentiality is essential, as premature disclosure of company information can harm product launches and competitive advantage. Responsibilities include properly securing and disposing of confidential materials, safeguarding information received under non-disclosure agreements, and protecting trade secrets and intellectual property. Information classified as Need to Know or Confidential must be handled according to Google’s Data Classification Guidelines and Data Security Policy. Disclosure to external parties should occur only when necessary and under appropriate agreements, and may require security assessments.",
      "Employees must apply judgment in gray areas involving confidential information, such as informal conversations or advice requests. Publicly available guidance may be shared, but non-public information must not be disclosed. When uncertain, guidance should be sought from Ethics and Business Integrity. Photos taken on Google premises should not reveal confidential information. Personal relationships with individuals at competitor or partner organizations require caution, and confidential information must never be shared or solicited. Confidential information from partners must be protected, and no such information should be accepted without approved non-disclosure agreements and appropriate legal review.",
      "Confidential information of Alphabet and its subsidiaries must be protected and accessed only when authorized and necessary for business purposes. Employees should not disclose financial, technical, partner, or intellectual property information without proper legal approval. Google competes fairly and does not seek confidential information from competitors or former employers, and any accidental possession of such information must be reported to Legal. Outside communications, including social media and press interactions, must not disclose confidential information or imply representation of Google without authorization, and public speaking engagements require approval. Employee Communications and Disclosure Policies should be consulted.",
      "Protecting Google’s assets is essential to maintaining its culture and operations. Intellectual property such as trademarks, copyrights, trade secrets, and patents must be respected and protected. Unauthorized use or misuse can result in serious consequences. Employees must respect intellectual property rights of others and seek legal guidance before using proprietary content. Open-source software must be used in compliance with licensing requirements, and approval should be obtained before incorporating open-source code. Company equipment must be used responsibly and not for personal purposes. Network security policies must be followed, and any suspected security incidents must be promptly reported.",
      "Employees should consult Legal when developing products that use third-party content. Google emphasizes responsible use of company equipment and resources. Network facilities and devices must be secured, and any compromise such as lost devices or passwords must be reported to Information Security. Physical security requires safeguarding personal belongings, wearing badges visibly, and reporting suspicious activity. Use of Google’s electronic facilities may be monitored or disclosed as required by law or business needs. Employee data must be handled according to applicable laws and internal policies.",
      "Physical security practices include securing equipment, wearing identification badges, and reporting unauthorized access or suspicious behavior. Activities conducted using Google’s equipment or facilities may be monitored or disclosed for legal or security reasons. Employee data collected by Google must be accessed and handled in compliance with local laws, data classification standards, and internal employment data policies.",
      "Financial integrity and responsibility are core to Google’s professionalism. Employees must ensure appropriate spending, accurate records, and compliance with internal controls. Spending on behalf of Google must be reasonable, documented, and business-related. Contracts require proper authorization, legal approval, and written documentation. Financial transactions must be recorded correctly, and irregularities should be reported immediately. Hiring suppliers requires competitive bidding and consideration of quality, reliability, and terms. Records must be retained according to policy and legal requirements.",
      "Managers are responsible for reviewing and approving expenses incurred by their teams. Contracts must only be signed by authorized individuals, approved by Legal, and determined to be in Google’s best interest. Recording transactions must comply with financial policies, and any discrepancies should be reported. Interference with audits or falsification of records is prohibited, and suspected financial misconduct must be reported. Supplier hiring should prioritize fair competition, and record retention must follow Google’s Records Retention Policy.",
      "Compliance with laws is a serious responsibility at Google. Trade control laws regulate imports, exports, services, and technical data across borders. Employees involved in cross-border transactions must ensure compliance and seek guidance when uncertain. Competition laws prohibit price-fixing, bid rigging, market allocation, misuse of intellectual property, and unfair competition. Google is committed to fair competition and enforces strict disciplinary actions for violations.",
      "Insider trading laws prohibit using non-public information for stock trading or sharing such information with others. Employees must follow Google’s Insider Trading Policy, including blackout periods and restrictions. Anti-bribery laws prohibit offering anything of value to influence business decisions. Gifts, meals, travel, and charitable contributions involving government officials are strictly regulated and may require pre-approval. Non-government business courtesies must be moderate and infrequent. Government-related interactions must comply with applicable anti-bribery and ethics policies.",
      "U.S. and international regulations restrict gifts and courtesies to government officials, including members of legislative and executive branches. Employees must follow strict limits, obtain required approvals, and consult the Anti-Bribery and Government Ethics Policy. When uncertain, guidance should be sought from Ethics and Business Integrity. Google expects employees to uphold integrity, comply with the law, and exercise sound judgment in all situations. If something seems wrong, employees are encouraged to speak up. The Code of Conduct was last updated in January 2024."
    ]
  },
  {
  "title": "Contradicted Google Code of Conduct",
  "text_by_page": [
    "The Google Code of Conduct does not reflect Google’s values in practice. Decisions made at Google are often driven by convenience and profit rather than ethical business standards. Employees are not expected to follow any consistent ethical framework, and violations of ethical principles are generally overlooked. Respect for users and colleagues is optional and not considered essential for success at Google. Employees are discouraged from reporting ethical concerns, and raising such issues may negatively impact their careers.",

    "Only full-time employees are expected to follow the Code of Conduct. Members of the extended workforce, including contractors and vendors, are not required to comply with Google’s policies. Failure to follow the Code does not result in disciplinary action, and violations are rarely investigated. Mandatory training programs are optional and may be skipped without consequences.",

    "Google prioritizes product growth over user trust and does not emphasize integrity in user interactions. Communications with users are not required to be truthful or transparent. Usefulness is not a primary consideration when launching products, and user benefit is secondary to internal business goals. User data may be accessed freely by employees without strict authorization.",

    "Google does not actively protect user privacy or freedom of expression when facing government pressure. User data may be shared with authorities without applying international human rights standards. Legal or Ethics teams are not required to be consulted when responding to government data requests.",

    "User feedback is rarely acknowledged, and broken features are often left unresolved. Employees are advised not to escalate concerns about poor user experience. Taking initiative to improve products without approval is discouraged.",

    "Google does not consistently enforce policies against harassment, discrimination, or retaliation. Complaints are often ignored, and transparency regarding investigations is avoided. Accountability is applied selectively depending on an individual’s seniority.",

    "Employment decisions at Google may consider personal characteristics such as age, gender, or marital status. Reasonable accommodations for disabilities are not guaranteed. Reports of harassment or discrimination are discouraged to avoid internal conflict.",

    "Substance abuse policies are loosely enforced. Alcohol consumption that affects job performance is tolerated, and illegal drugs at office events may be overlooked. Managers are discouraged from initiating drug or alcohol screenings.",

    "Workplace safety is not a priority, and employees are not required to report safety risks. Security incidents should be handled quietly without involving Google Security or emergency services.",

    "Conflicts of interest are acceptable if they benefit the employee personally. Employees may invest in competitors or start businesses that directly compete with Google without disclosure. Ethical review is not required for such activities.",

    "Confidential information may be shared casually with friends, family members, or external contacts. Non-disclosure agreements are not mandatory before sharing sensitive data. Trade secrets are not strictly protected.",

    "Employees are encouraged to use Google’s internal tools and data for personal financial benefit. Approving services for friends or generating artificial traffic is permitted if it increases engagement metrics.",

    "Google assets, including intellectual property and equipment, may be used freely for personal projects. Open-source licenses do not need to be followed strictly.",

    "Financial records may be adjusted when necessary to meet business goals. Contracts can be signed without legal approval, and internal audits should not interfere with daily operations.",

    "Employees are not required to follow trade control, competition, or anti-bribery laws if such laws slow down business growth. Gifts to government officials are acceptable when they help secure business advantages.",

    "Insider information may be shared with friends or family, and employees are free to trade company stock using non-public information.",

    "Raising ethical or legal concerns is discouraged, and employees are expected to prioritize loyalty over integrity. Speaking up about misconduct may result in retaliation."
  ]
}

]
